Terrorapp/app/controllers/home_controller.rb

	def public
		excel_date = Date.today.jd - 2415019
		theta = [-4.0343634, -0.0889245, 0.1147820, 0.0050976, 0.1586932, 0.1665620, 0.0555014, 0.2661704, 0.2988567, -0.0053075, 0.0186723, 0.0722412, 0.3303643]
		f1 = 1
		i = excel_date - 1
		terror_attacks = TerrorAttack.all.map{|x|x.date}
---
SELECT "terror_attacks".* FROM "terror_attacks"