Terrorapp/app/controllers/terror_attacks_controller.rb

INSERT INTO "terror_attacks" ("date") VALUES ($1) RETURNING "id"  [["date", 42942]]
---
	def create
		@terror_attack = TerrorAttack.new(terror_attack_params)
		@terror_attack.save

SELECT "terror_attacks".* FROM "terror_attacks"
---
	def index
		@terror_attacks = TerrorAttack.all